{
    "version": "https://jsonfeed.org/version/1",
    "title": "There is something wrong...",
    "description": "",
    "home_page_url": "https://words.vanderbasch.com",
    "feed_url": "https://words.vanderbasch.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Bonno van der Basch"
    },
    "items": [
        {
            "id": "https://words.vanderbasch.com/generating-font-awesome-png-files/",
            "url": "https://words.vanderbasch.com/generating-font-awesome-png-files/",
            "title": "Generating font awesome PNG files",
            "summary": "So… I was in a bind yesterday when I wanted to use one of Font Awesome’s icons as a favicon. Because, you know… I’m all about consistency. Thing is though, it’s not in an image format. Luckily I came across a site that let’s you&hellip;",
            "content_html": "<p>So… I was in a bind yesterday when I wanted to use one of <a href=\"http://fontawesome.io\" title=\"FontAwesome\">Font Awesome’s</a>  icons as a favicon. Because, you know… I’m all about consistency.  Thing is though, it’s not in an image format. </p>\n<p>Luckily I came across a site that let’s you solve that: <a href=\"http://fa2png.io/\" title=\"FA2PNG\">fa2png</a>.  The site is free to use and works on mobile phones as well. Best of all, they allow you to customize the colors using hex codes and the generated images do not require (additional) attribution when you use them. </p>\n<p>I know I’ll be using this site in the future for sure. I hope you’ll find it useful as well. </p>\n",
            "image": "https://words.vanderbasch.com/media/posts/2/harpal-singh-_zKxPsGOGKg-unsplash.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "web icons",
                   "web apps",
                   "tips and tricks",
                   "icons",
                   "iconography",
                   "font awesome",
                   "fa2png"
            ],
            "date_published": "2017-06-04T09:45:00+02:00",
            "date_modified": "2020-10-09T18:28:52+02:00"
        },
        {
            "id": "https://words.vanderbasch.com/how-to-solve-qnap-disk-initialization-problems/",
            "url": "https://words.vanderbasch.com/how-to-solve-qnap-disk-initialization-problems/",
            "title": "How to solve QNAP disk initialization problems",
            "summary": "The backstory Linux and I respect eachother as worthy foes… We have that love/hate realationship that just seems to work. Every now and then I need linux. I simply do… And on those moments we both throw down for a spectacular fight and see who&hellip;",
            "content_html": "<h2 id=\"the-backstory\">The backstory</h2>\n<p>Linux and I respect eachother as worthy foes… We have that love/hate realationship that just seems to work. Every now and then I <em>need</em> linux. I simply do… And on those moments we both throw down for a spectacular fight and see who comes out on top.</p>\n<p>This weekend was no different. As a thank you gift for some services rendered I received a <a href=\"http://http://www.qnap.com/nl/?lang=nl&amp;sn=531&amp;c=310&amp;sc=577&amp;t=586&amp;n=3613\">QNAP TS-219P+</a> that I had big plans for. I have 2 external drives, one for media and one for incremental backups so sticking them into the NAS would surely ease my daily routines.</p>\n<p>Dismanteling the drives wasn’t all that challenging and before no time the first disk was installed in the NAS. I decided to start with just one disk (the media one), because it didn’t hold any important data anyway and I was unsure if the NAS needed to format the drives in order to use them.</p>\n<p>I ran the first use utility and the set-up was pretty straight forward. Since I don’t really like <a href=\"http://http://www.raidrecoveryonline.com/jbod_raid/\">JBOD</a> I opted to let the NAS skip RAID and just view each tray as a single disk. In retrospect this was a bad move :(</p>\n<h2 id=\"the-problem\">The problem</h2>\n<p>Once I had the NAS set up and was done moving all my data to the NAS I dismanteled the remaining drive and popped it in the NAS. I tried <strong>hot plugging</strong> it to see if the NAS would go for it and surely it did. Well… <em>sort of…</em></p>\n<p>Whatever I tried, the NAS would refuse to initialize the drive! It would just keep telling me:</p>\n<blockquote>\n<p><code>[Singe Disk Volume: Drive 2] Formatting failed.</code> </p>\n<p><code>[Singe Disk Volume: Drive 2] Formatting failed(Cannot unmount disk).</code></p>\n</blockquote>\n<p>None of QNAP’s own documentation seemed to work as well as standard LINUX stuff. I later learned that QNAP operates on a slightly modded version of <a href=\"http://http://www.busybox.net/\">BUSYBOX</a></p>\n<h2 id=\"the-fix\">The fix</h2>\n<p>The fix was relatively simple, but I had to use steps from various other fixes (maily from people having problems with JBOD).</p>\n<ol>\n<li>Connect to the NAS with <a href=\"http://http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html\">SSH</a> (<strong>NOTE: you can only SSH into the NAS with the admin account - admin / password</strong>)</li>\n<li>Stop all the running services with the following command <code>/etc/init.d/services.sh stop</code></li>\n<li>Format the drive with ONE, and <strong>ONLY ONE</strong> partition using <a href=\"http://http://www.ehow.com/how_1000631_hard-drive-linux.html\">fdisk</a>. You should be presented with the <em>error 16</em> when you reach the final step and attempt to write the changes</li>\n<li><strong>POWER DOWN</strong> the NAS. Do not reboot instead. I you reboot the disk will remain unitialized.</li>\n<li>After powering back up, log into the web interface and navigate to storage manager. The second disk should now say that it is not yet mounted. <strong>DO NOT</strong> attempt to mount the disk from SSH as this will just show errors and will force you to power down again.</li>\n<li><strong>FORMAT</strong> the drive from the webinterface. It will automatically mount everything as it sees fit and you should end  up with a mounted usable second drive.</li>\n</ol>\n<p>I hope this will help some of you that are facing the same annoying issue I was facing. you’ve been a worthy foe linux. I will see you again soon for our next battle.</p>\n",
            "image": "https://words.vanderbasch.com/media/posts/1/markus-spiske-5yEiCUynJ9w-unsplash.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "troubleshooting",
                   "ssh",
                   "qnap",
                   "nas",
                   "linux",
                   "fdisk",
                   "busybox"
            ],
            "date_published": "2014-05-18T18:04:00+02:00",
            "date_modified": "2021-12-17T12:37:45+01:00"
        },
        {
            "id": "https://words.vanderbasch.com/online-favicon-extractor/",
            "url": "https://words.vanderbasch.com/online-favicon-extractor/",
            "title": "Online Favicon Extractor",
            "summary": "I found a cool “hidden” feature on the Yandex search engine. It is able to extract the favicon from any domain even if the server hosting the domain does not allow the visitor to do so. Simply click on the link and modify the url&hellip;",
            "content_html": "<p>I found a cool “hidden” feature on the <a href=\"http://favicon.yandex.net/favicon/\">Yandex search engine</a>. It is able to extract the favicon from any domain even if the server hosting the domain does not allow the visitor to do so. Simply click on the link and modify the url afterwards. Include the full domain including www after the slash and voila, a favicon ready to be saved. Great for password managers that support custom icons.</p>\n<h3 id=\"instructions\">Instructions</h3>\n<ol>\n<li>Link points to <a href=\"http://favicon.yandex.net/favicon/\">http://favicon.yandex.net/favicon/</a></li>\n<li>Want, let’s say the tumblr. favicon? Modify the above link to <a href=\"http://favicon.yandex.net/favicon/www.tumblr.com\">http://favicon.yandex.net/favicon/www.tumblr.com</a></li>\n<li>That’s it!</li>\n</ol>\n",
            "image": "https://words.vanderbasch.com/media/posts/3/piotr-hamryszczak-P2k3JttAlho-unsplash.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "yandex",
                   "tips and tricks",
                   "search engines",
                   "icons"
            ],
            "date_published": "2013-01-11T16:29:00+01:00",
            "date_modified": "2020-10-09T18:36:07+02:00"
        },
        {
            "id": "https://words.vanderbasch.com/nieuwe-muis/",
            "url": "https://words.vanderbasch.com/nieuwe-muis/",
            "title": "Nieuwe muis!",
            "summary": " Dit is m geworden: de Steelseries Ikari laser! Al lange tijd ben ik op zoek naar de ideale toetsenbord en muis combinatie om mij mee uit te leven. Na een tijd gespeeld te hebben met een standaard Logitech deskset (waar op zich niets mis&hellip;",
            "content_html": "\n    <h2 id=\"dit-is-m-geworden-de-steelseries-ikari-laser\">\n      Dit is m geworden: de Steelseries Ikari laser!\n    </h2>\n\n  <div  class=\"gallery-wrapper gallery-wrapper--center\">\n    <div class=\"gallery\" data-columns=\"3\">\n      <figure class=\"gallery__item\">\n      <a href=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo1_1280.jpg\" data-size=\"1280x960\">\n        <img loading=\"lazy\" src=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo1_1280-thumbnail.jpg\" height=\"576\" width=\"768\" alt=\"\" />\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo2_1280.jpg\" data-size=\"1280x960\">\n        <img loading=\"lazy\" src=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo2_1280-thumbnail.jpg\" height=\"576\" width=\"768\" alt=\"\" />\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo3_1280.jpg\" data-size=\"1280x960\">\n        <img loading=\"lazy\" src=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo3_1280-thumbnail.jpg\" height=\"576\" width=\"768\" alt=\"\" />\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo4_1280.jpg\" data-size=\"1280x960\">\n        <img loading=\"lazy\" src=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo4_1280-thumbnail.jpg\" height=\"576\" width=\"768\" alt=\"\" />\n      </a>\n      \n    </figure><figure class=\"gallery__item\">\n      <a href=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo5_1280.jpg\" data-size=\"1280x960\">\n        <img loading=\"lazy\" src=\"https://words.vanderbasch.com/media/posts/6/gallery/tumblr_m9ycziCCbR1rekzjxo5_1280-thumbnail.jpg\" height=\"576\" width=\"768\" alt=\"\" />\n      </a>\n      \n    </figure>\n    </div>\n  </div>\n\n  <p>\n    Al lange tijd ben ik op zoek naar de ideale toetsenbord en muis combinatie om mij mee uit te leven. Na een tijd gespeeld te hebben met een standaard Logitech deskset (waar op zich niets mis mee is) besloot ik toch op zoek te gaan naar wat serieuzer werk. Vroeger zat ik hoofdzakelijk achter mijn PC voor huiswerk en wat Photoshop, maar tot enige tijd geleden ben ik echt heel serieus met PC gaming bezig geweest en heb ik zelfs in een team/competitie meegespeeld.\n  </p>\n\n  <p>\n    Goed, na heel veel google-en viel mijn oog op de volgende toetsenbord en muis combinatie: de <a href=\"http://www.roccat.org/Products/Gaming-Keyboards/ROCCAT-Arvo/\" target=\"_blank\">ROCCAT Arvo</a> met de <a href=\"http://www.esportnova.com/index.php?option=com_content&amp;task=view&amp;id=93&amp;Itemid=172\" target=\"_blank\">Nova Slider X600</a>. Deze combinatie heb ik geruime tijd met plezier gebruikt en hoewel ze in mijn ogen perfect zijn om mee te gamen, zijn ze ook niet meer dan dat. Sterker nog, mijn Arvo toetsenbord verving ik al vrij snel door een <a href=\"http://www.microsoft.com/hardware/en-us/p/sidewinder-x6-keyboard#details\" target=\"_blank\">Microsoft Sidewinder X6</a> omdat het toetsenbord mij bij alles wat niet met gaming te maken had tot pure waanzin dreef. Als het gaat om het kiezen toetsenbord/muis/muismat is is het belangrijkste element toch wel persoonlijke voorkeur en ik heb altijd gevonden dat Microsoft toetsenborden heerlijk aanvoelen. Toen Microsoft met een degelijk gaming keyboard op de markt kwam was voor mij dat ook de keuze snel gemaakt :)\n  </p>\n\n  <p>\n    Mijn Nova hield het langer vol, maar de laatste paar maanden kwam ook daarvan naar voren dat het beestje zich toch het beste voelde tijdens het gamen. De muisknoppen zijn op een bijzondere manier gefabriceerd, waardoor heel snel herhaaldelijk klikken (voor de gamers die dit lezen: <i>optimized for burst fire</i>) een makkie is. Maar, het vasthouden van de muisknop voor simpelere zaken zoals tekst selecteren en het <i>drag- en droppen</i> van bestanden is iets dat daardoor veel meer inspanning vergt. Dit uit zich in het begin als kleine frustraties, maar naarmate het gamen afnam en het 'normale' Windows gebruik toenam groeide deze uit tot regelrechte ergernis.\n  </p>\n\n  <p>\n    Daarom een paar maanden geleden toch maar besloten om op zoek te gaan naar een waardige vervanger. Na heel veel google-en en heel veel muisjes betasten heb ik gisteren dan toch eindelijk de knoop doorgehakt en gekozen voor een <a href=\"http://steelseries.com/products/mice/steelseries-ikari-laser\" target=\"_blank\">Steelseries Ikari laser</a>. Een heerlijke muis, die een ongekend comfort biedt. Ik heb tot nu toe nog steeds geen muis vastgehouden die lekkerder aanvoelt dan deze. Begrijp me niet verkeerd, als ik naar een LAN ga weet ik zeker dat ik altijd mijn Nova mee zal slepen. Er IS gewoon geen muis die ook maar in de buurt komt van de perfect gevonden balans tussen functie en comfort (als het op gamen neerkomt) van de Nova. Niet voor niets zijn er ook al een aantal <a href=\"http://www.ozonegaming.com/product.php?id=2\" target=\"_blank\">low budget copycats</a> van de Nova op de markt verschenen. Maar als het gaat om thuis werken: een Steelseries Ikari? Ik wil niets anders meer!\n  </p>",
            "image": "https://words.vanderbasch.com/media/posts/6/tumblr_m9ycziCCbR1rekzjxo1_1280.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "Steelseries",
                   "Nova",
                   "Hardware",
                   "Gaming Mouse",
                   "Gaming"
            ],
            "date_published": "2011-07-28T13:11:00+02:00",
            "date_modified": "2021-12-17T21:58:35+01:00"
        }
    ]
}
