{
    "version": "https://jsonfeed.org/version/1",
    "title": "There is something wrong...",
    "description": "",
    "home_page_url": "https://words.vanderbasch.com",
    "feed_url": "https://words.vanderbasch.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Bonno van der Basch"
    },
    "items": [
        {
            "id": "https://words.vanderbasch.com/generating-font-awesome-png-files/",
            "url": "https://words.vanderbasch.com/generating-font-awesome-png-files/",
            "title": "Generating font awesome PNG files",
            "summary": "So… I was in a bind yesterday when I wanted to use one of Font Awesome’s icons as a favicon. Because, you know… I’m all about consistency. Thing is though, it’s not in an image format. Luckily I came across a site that let’s you&hellip;",
            "content_html": "<p>So… I was in a bind yesterday when I wanted to use one of <a href=\"http://fontawesome.io\" title=\"FontAwesome\">Font Awesome’s</a>  icons as a favicon. Because, you know… I’m all about consistency.  Thing is though, it’s not in an image format. </p>\n<p>Luckily I came across a site that let’s you solve that: <a href=\"http://fa2png.io/\" title=\"FA2PNG\">fa2png</a>.  The site is free to use and works on mobile phones as well. Best of all, they allow you to customize the colors using hex codes and the generated images do not require (additional) attribution when you use them. </p>\n<p>I know I’ll be using this site in the future for sure. I hope you’ll find it useful as well. </p>\n",
            "image": "https://words.vanderbasch.com/media/posts/2/harpal-singh-_zKxPsGOGKg-unsplash.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "web icons",
                   "web apps",
                   "icons",
                   "iconography",
                   "font awesome",
                   "fa2png"
            ],
            "date_published": "2020-09-22T16:26:54+02:00",
            "date_modified": "2020-09-22T16:26:54+02:00"
        },
        {
            "id": "https://words.vanderbasch.com/how-to-solve-qnap-disk-initialization-problems/",
            "url": "https://words.vanderbasch.com/how-to-solve-qnap-disk-initialization-problems/",
            "title": "How to solve QNAP disk initialization problems",
            "summary": "The backstoryLinux and I respect eachother as worthy foes… We have that love/hate realationship that just seems to work. Every now and then I need linux. I simply do… And on those moments we both throw down for a spectacular fight and see who comes&hellip;",
            "content_html": "<h2 id=\"the-backstory\">The backstory</h2>\n<p>Linux and I respect eachother as worthy foes… We have that love/hate realationship that just seems to work. Every now and then I <em>need</em> linux. I simply do… And on those moments we both throw down for a spectacular fight and see who comes out on top.</p>\n<p>This weekend was no different. As a thank you gift for some services rendered I received a <a href=\"http://http://www.qnap.com/nl/?lang=nl&amp;sn=531&amp;c=310&amp;sc=577&amp;t=586&amp;n=3613\">QNAP TS-219P+</a> that I had big plans for. I have 2 external drives, one for media and one for incremental backups so sticking them into the NAS would surely ease my daily routines.</p>\n<p>Dismanteling the drives wasn’t all that challenging and before no time the first disk was installed in the NAS. I decided to start with just one disk (the media one), because it didn’t hold any important data anyway and I was unsure if the NAS needed to format the drives in order to use them.</p>\n<p>I ran the first use utility and the set-up was pretty straight forward. Since I don’t really like <a href=\"http://http://www.raidrecoveryonline.com/jbod_raid/\">JBOD</a> I opted to let the NAS skip RAID and just view each tray as a single disk. In retrospect this was a bad move :(</p>\n<h2 id=\"the-problem\">The problem</h2>\n<p>Once I had the NAS set up and was done moving all my data to the NAS I dismanteled the remaining drive and popped it in the NAS. I tried <strong>hot plugging</strong> it to see if the NAS would go for it and surely it did. Well… <em>sort of…</em></p>\n<p>Whatever I tried, the NAS would refuse to initialize the drive! It would just keep telling me:</p>\n<blockquote>\n<p><code>[Singe Disk Volume: Drive 2] Formatting failed.</code> </p>\n<p><code>[Singe Disk Volume: Drive 2] Formatting failed(Cannot unmount disk).</code></p>\n</blockquote>\n<p>None of QNAP’s own documentation seemed to work as well as standard LINUX stuff. I later learned that QNAP operates on a slightly modded version of <a href=\"http://http://www.busybox.net/\">BUSYBOX</a></p>\n<h2 id=\"the-fix\">The fix</h2>\n<p>The fix was relatively simple, but I had to use steps from various other fixes (maily from people having problems with JBOD).</p>\n<ol>\n<li>Connect to the NAS with <a href=\"http://http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html\">SSH</a> (<strong>NOTE: you can only SSH into the NAS with the admin account - admin / password</strong>)</li>\n<li>Stop all the running services with the following command <code>/etc/init.d/services.sh stop</code></li>\n<li>Format the drive with ONE, and <strong>ONLY ONE</strong> partition using <a href=\"http://http://www.ehow.com/how_1000631_hard-drive-linux.html\">fdisk</a>. You should be presented with the <em>error 16</em> when you reach the final step and attempt to write the changes</li>\n<li><strong>POWER DOWN</strong> the NAS. Do not reboot instead. I you reboot the disk will remain unitialized.</li>\n<li>After powering back up, log into the web interface and navigate to storage manager. The second disk should now say that it is not yet mounted. <strong>DO NOT</strong> attempt to mount the disk from SSH as this will just show errors and will force you to power down again.</li>\n<li><strong>FORMAT</strong> the drive from the webinterface. It will automatically mount everything as it sees fit and you should end  up with a mounted usable second drive.</li>\n</ol>\n<p>I hope this will help some of you that are facing the same annoying issue I was facing. you’ve been a worthy foe linux. I will see you again soon for our next battle.</p>\n",
            "image": "https://words.vanderbasch.com/media/posts/1/markus-spiske-5yEiCUynJ9w-unsplash.jpg",
            "author": {
                "name": "Bonno van der Basch"
            },
            "tags": [
                   "troubleshooting",
                   "ssh",
                   "qnap",
                   "nas",
                   "linux",
                   "fdisk",
                   "busybox"
            ],
            "date_published": "2020-09-22T16:26:54+02:00",
            "date_modified": "2020-09-22T16:26:54+02:00"
        }
    ]
}
